Revit 2027 API
BuiltInFailures.MassFailures.FloorMightLookWrong Property
 Mass Floors may appear incorrect since the Mass contains mesh and solid geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FloorMightLookWrong { get; }
Public Shared ReadOnly Property FloorMightLookWrong As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FloorMightLookWrong {
	FailureDefinitionId^ get ();
}
static member FloorMightLookWrong : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace